---
kind: property
id: P:Autodesk.Revit.Exceptions.ArgumentException.Message
zh: 消息、提示
source: html/c2498b95-ccc5-95cc-d5c2-7e732615e940.htm
---
# Autodesk.Revit.Exceptions.ArgumentException.Message Property

**中文**: 消息、提示

Gets the error message and the parameter name, or only the error message if no parameter name is set.

## Syntax (C#)
```csharp
public override string Message { get; }
```

## Remarks
The text of Message should completely describe the error and should, when possible, explain how to correct it.